//Створення розгалуджених програм
//Варіант 29, завдання if
Console.OutputEncoding = System.Text.Encoding.Default; // усунення проблем відображання української мови

int a; 

string par;//parity(парність)

Console.WriteLine("Ввeдiть число: ");
a = Convert.ToInt32(Console.ReadLine());

if (a % 2 == 0) // перевірка числа на парність
{
    par = "парне";
}
else // якщо число не парне, виконується друга дія
{
    par = "не парне";
}


if (a == 0) // якщо введене число буде рівне 0, то виконається перша дія
{
    Console.WriteLine("Це нульове число");
}
else if (a < 0) // якщо введене число менше 0, то виконається друга дія
{
    Console.WriteLine("Це вiд'ємне " + par + " число");
}
else if (a > 0) // якщо введене число більше 0, то виконається третя дія
{
    Console.WriteLine("Це додатне " + par + " число");
}